#+STYLE: <link rel="stylesheet" type="text/css" href="style.css">
#+startup: indent
#+TITLE: pg-org.org: Customizations to org-mode

****** Testing

In Listing [[t/match/1]], we do one last white-box test of the macro to ensure that it generates the kind of code we expect.

#+name: t/match/1
#+caption: Testing pg-org-match
#+begin_src emacs-lisp :noweb yes :exports code :tangle no :results drawer
  <<src/-match-build-pattern>>
  <<src/match>>

  (ert-deftest pg-org/match/1 ()
    (let*  ((output (macroexpand-1
                     '(pg-org-match
                       ((:-pred (org-ml-headline-has-tag "work" el))) node)))
            (sym (cadr (caaadr output)))
            (expected `(cl-letf
                           (((symbol-function ,sym) (lambda (el)
                                    (org-ml-headline-has-tag "work" el))))
                         (org-ml-match ((:pred ,sym)) node))))
      (should (symbolp sym))
      (should (equal output expected))))

  (pg-ert-run-tests-string "pg-org/match/1")

#+end_src

But will it blend? Let's find out. Our input for these tests is in Listing [[input-pg-org-match/t]].

#+name: input/match
#+caption: Sample used for testing
#+begin_src org
  ,#+seq_todo: TODO  DOING(@) BLOCKED(@) | DONE(@)


  ,* DOING Rewire the security system
    :PROPERTIES:
    :ASSIGNEE: Bart Starr
    :END:
    :LOGBOOK:
    - State "DOING"      from "BLOCKED"    [2021-12-11 Sat 20:06] \\
      Back on the case
    - State "BLOCKED"    from "DOING"      [2021-12-11 Sat 20:05] \\
      Waiting on parts from the supplier
    - State "DOING"      from "TODO"       [2021-12-11 Sat 20:04] \\
      In process, it's harder than it looks
    - Not a status update
    :END:

  ,* TODO Something else to do
    :PROPERTIES:
    :ASSIGNEE: Johnny Unitas
    :END:
#+end_src



#+name: t/match/2
#+caption: A test showing the how pg-org--match-build-pattern works. Only the headline for "Rewire the security system" is selected because it contains a logbook.
#+begin_src emacs-lisp :noweb yes :exports code :tangle no :results drawer
  <<src/logging-configuration>>
  <<src/-match-build-pattern>>
  <<src/match>>

  (pg-org-deftest pg-org/match/2
      input/match
    (let ((results (pg-org-match
                    '((:and headline
                            (:lookahead
                             (section
                              (:and drawer
                                    (:drawer-name "LOGBOOK"))))))
                    (org-ml-remove-parents doc)
                    )))
      (should (= (length results) 1))
      (let ((result (car results)))
        (should (equal (org-ml-get-type result) 'headline))
        (should (equal (org-ml-get-property :raw-value result)
                       "Rewire the security system")))))

  (pg-ert-run-tests-string "pg-org/match/2")
#+end_src

#+RESULTS: t/match/2
:results:
   passed  1/1  pg-org/match/2 (0.000528 sec)

Ran 1 tests, 1 results as expected, 0 unexpected (2021-12-29 23:05:29-0500, 0.000729 sec)
:end:

#+name: scratch/1
#+caption: A test showing the how pg-org--match-build-pattern works
#+begin_src emacs-lisp :noweb yes :exports code :tangle no :results code
  <<src/-match-build-pattern>>
  <<src/match>>

  (pg-org-with-src-doc input/match
    (pg-org-match
     '((:and headline
             (:lookahead
              (section
               (:and drawer
                     (:drawer-name "LOGBOOK"))))))
     (org-ml-remove-parents doc)
     ))

#+end_src

#+RESULTS: scratch/1
#+begin_src emacs-lisp
((headline
  (:raw-value "Rewire the security system" :begin 51 :end 481 :pre-blank 0 :contents-begin 86 :contents-end 480 :level 1 :priority nil :tags nil :todo-keyword "DOING" :todo-type todo :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 51 :ASSIGNEE "Bart Starr" :title
              ("Rewire the security system")
              :parent nil)
  (section
   (:begin 86 :end 481 :contents-begin 86 :contents-end 480 :post-blank 1 :post-affiliated 86 :parent nil)
   (property-drawer
    (:begin 86 :end 133 :contents-begin 101 :contents-end 125 :post-blank 0 :post-affiliated 86 :parent nil)
    (node-property
     (:key "ASSIGNEE" :value "Bart Starr" :begin 101 :end 125 :post-blank 0 :post-affiliated 101 :parent nil)))
   (drawer
    (:begin 133 :end 480 :drawer-name "LOGBOOK" :contents-begin 145 :contents-end 472 :post-blank 0 :post-affiliated 133 :parent nil)
    (plain-list
     (:type unordered :begin 145 :end 472 :contents-begin 145 :contents-end 472 :structure
            ((145 2 "- " nil nil nil 233)
             (233 2 "- " nil nil nil 339)
             (339 2 "- " nil nil nil 448)
             (448 2 "- " nil nil nil 472))
            :post-blank 0 :post-affiliated 145 :parent nil)
     (item
      (:bullet "- " :begin 145 :end 233 :contents-begin 149 :contents-end 233 :checkbox nil :counter nil :structure
               ((145 2 "- " nil nil nil 233)
                (233 2 "- " nil nil nil 339)
                (339 2 "- " nil nil nil 448)
                (448 2 "- " nil nil nil 472))
               :pre-blank 0 :post-blank 0 :post-affiliated 145 :tag nil :parent nil)
      (paragraph
       (:begin 149 :end 233 :contents-begin 149 :contents-end 233 :post-blank 0 :post-affiliated 149 :parent nil)
       "State \"DOING\"      from \"BLOCKED\"    "
       (timestamp
        (:type inactive :raw-value "[2021-12-11 Sat 20:06]" :year-start 2021 :month-start 12 :day-start 11 :hour-start 20 :minute-start 6 :year-end 2021 :month-end 12 :day-end 11 :hour-end 20 :minute-end 6 :begin 186 :end 209 :post-blank 1 :parent nil))
       (line-break
        (:begin 209 :end 212 :post-blank 0 :parent nil))
       "    Back on the case\n"))
     (item
      (:bullet "- " :begin 233 :end 339 :contents-begin 237 :contents-end 339 :checkbox nil :counter nil :structure
               ((145 2 "- " nil nil nil 233)
                (233 2 "- " nil nil nil 339)
                (339 2 "- " nil nil nil 448)
                (448 2 "- " nil nil nil 472))
               :pre-blank 0 :post-blank 0 :post-affiliated 233 :tag nil :parent nil)
      (paragraph
       (:begin 237 :end 339 :contents-begin 237 :contents-end 339 :post-blank 0 :post-affiliated 237 :parent nil)
       "State \"BLOCKED\"    from \"DOING\"      "
       (timestamp
        (:type inactive :raw-value "[2021-12-11 Sat 20:05]" :year-start 2021 :month-start 12 :day-start 11 :hour-start 20 :minute-start 5 :year-end 2021 :month-end 12 :day-end 11 :hour-end 20 :minute-end 5 :begin 274 :end 297 :post-blank 1 :parent nil))
       (line-break
        (:begin 297 :end 300 :post-blank 0 :parent nil))
       "    Waiting on parts from the supplier\n"))
     (item
      (:bullet "- " :begin 339 :end 448 :contents-begin 343 :contents-end 448 :checkbox nil :counter nil :structure
               ((145 2 "- " nil nil nil 233)
                (233 2 "- " nil nil nil 339)
                (339 2 "- " nil nil nil 448)
                (448 2 "- " nil nil nil 472))
               :pre-blank 0 :post-blank 0 :post-affiliated 339 :tag nil :parent nil)
      (paragraph
       (:begin 343 :end 448 :contents-begin 343 :contents-end 448 :post-blank 0 :post-affiliated 343 :parent nil)
       "State \"DOING\"      from \"TODO\"       "
       (timestamp
        (:type inactive :raw-value "[2021-12-11 Sat 20:04]" :year-start 2021 :month-start 12 :day-start 11 :hour-start 20 :minute-start 4 :year-end 2021 :month-end 12 :day-end 11 :hour-end 20 :minute-end 4 :begin 380 :end 403 :post-blank 1 :parent nil))
       (line-break
        (:begin 403 :end 406 :post-blank 0 :parent nil))
       "    In process, it's harder than it looks\n"))
     (item
      (:bullet "- " :begin 448 :end 472 :contents-begin 452 :contents-end 472 :checkbox nil :counter nil :structure
               ((145 2 "- " nil nil nil 233)
                (233 2 "- " nil nil nil 339)
                (339 2 "- " nil nil nil 448)
                (448 2 "- " nil nil nil 472))
               :pre-blank 0 :post-blank 0 :post-affiliated 448 :tag nil :parent nil)
      (paragraph
       (:begin 452 :end 472 :contents-begin 452 :contents-end 472 :post-blank 0 :post-affiliated 452 :parent nil)
       "Not a status update\n")))))))
#+end_src





